velioo_webserver_perl/tests/ab_test_application_4.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8886

Document Path:          /application
Document Length:        136 bytes

Concurrency Level:      100
Time taken for tests:   354.806 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      20100000 bytes
HTML transferred:       13600000 bytes
Requests per second:    281.84 [#/sec] (mean)
Time per request:       354.806 [ms] (mean)
Time per request:       3.548 [ms] (mean, across all concurrent requests)
Transfer rate:          55.32 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       5
Processing:    18  355  24.2    349     660
Waiting:        4  351  24.1    345     656
Total:         23  355  24.2    349     660

Percentage of the requests served within a certain time (ms)
  50%    349
  66%    353
  75%    357
  80%    360
  90%    377
  95%    401
  98%    426
  99%    446
 100%    660 (longest request)