velioo_webserver_perl/tests/ab_test_application_6.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8886

Document Path:          /application
Document Length:        136 bytes

Concurrency Level:      100
Time taken for tests:   39.291 seconds
Complete requests:      10353
Failed requests:        0
Total transferred:      2081148 bytes
HTML transferred:       1408008 bytes
Requests per second:    263.50 [#/sec] (mean)
Time per request:       379.510 [ms] (mean)
Time per request:       3.795 [ms] (mean, across all concurrent requests)
Transfer rate:          51.73 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       5
Processing:    13  377  30.3    375     524
Waiting:        3  371  29.8    369     507
Total:         18  378  30.0    375     524

Percentage of the requests served within a certain time (ms)
  50%    375
  66%    381
  75%    386
  80%    389
  90%    397
  95%    412
  98%    449
  99%    492
 100%    524 (longest request)